barrylw/lamp_project_slave/STM32F051_contiki_8M/APP/gpio_per.c
#include "gpio_per.h"   
#include "hal_uart.h"
#include "hal_flash.h"
#include "math.h"
#include "stdio.h"
#include "apl.h"
#include "string.h"
#include "hal_led.h"
#include "hal_timer.h"
#include "stm32f0xx_adc.h"
#include <sys/clock.h>

#define UI_220    220.0
#define IB_05     0.5

#define SAFE_START_TIME      30000

extern char g_updateBuffer[];
extern char *paralist[];
extern USART_TypeDef *COM_USART[];

static bool  enable_save_elc = false;
static bool  flash_ok        = true;

PROCESS_NAME(period_save_data_process);


RN8209C_PARAM rn8209c_papameter = 
{
      .HFConst      = 4026,              //表常数项设置
      .PStart       = 0,	             //启动设置
      .GPQA         = 0,                 //A有功增益校正   	
      .PhsA         = 0,                 //A有功角度校正           	   	
      .QPhsCal      = 0,                 //无功角度校正     	
      .PFcount      = 0,                 //保存的能量积分，掉电时保存
      .energyAPulse = 0,                 //有功电量，电量小于一度电，以脉冲数表示   
      .Ku           = 0,                 //电压系数  mv                              
      .KIa          = 0,		         //电流A系数 ma			
      .Kp           = 0,	             //功率系数  mw					
      .Uv           = 0,                 //电压有效值
      .Ia           = 0,                 //电流有效值
      .Pa           = 0,                 //功率有效值
      .ChkSum       = 0,                 //校验和
      .calibration  = 0,                 //是否校正
      .EC           = 12800,
      .pwmValue     = 100,
      .lightTime    = 0,
 };

/*
关灯
define relay_open()  
开灯
define relay_close()
读取电量
read_8209c_energyP()
读电压
read_8209c_U()
读电流
read_8209c_Ia()
读功率
read_8209c_Pa()
调光
set_PWM(u8 PWMx, u8 PWMdiv)
检测调光电压
read_PWM_volt()
检测灯状态
read_LED_state()
*/


/*****************************************************************************
 Prototype    : start_time_detect_process
 Description  : 上电保护进程，上电后在保护时间 SAFE_START_TIME 内，不允许操作flash，以及执行掉电保护功能
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
PROCESS(start_time_detect_process, "safe_start");
PROCESS_THREAD(start_time_detect_process, ev, data)
{
  static struct etimer start_etimer; 
  
  static u16 length;
  
  PROCESS_BEGIN();
  
   etimer_set(&start_etimer, SAFE_START_TIME);
   
   while (1)
   {
     PROCESS_WAIT_EVENT_UNTIL(ev == PROCESS_EVENT_TIMER);
      
     if ((struct etimer *)data == &start_etimer)
     {
       enable_save_elc = true;

       process_start(&period_save_data_process, NULL);
       
       if (flash_ok == true)
       {
            length =   find_free_addr(FLASH_ELC_SAVE_ADDRESS);

            if(  (length >= (1024 - ELC_FILE_TAIL_LEN))  )
            {
                read_8209c_energyP();
                format_elc_data();

                if (FLASH_ErasePage(FLASH_ELC_SAVE_ADDRESS) == FLASH_COMPLETE)
                {
                    FLASH_Write_chars( FLASH_ELC_SAVE_ADDRESS, (u8*)g_updateBuffer , ELC_FLIE_LEN);
                }  
             }
             else if (length == 0)
             {
                read_8209c_energyP();
                format_elc_data();
                FLASH_Write_chars( FLASH_ELC_SAVE_ADDRESS, (u8*)g_updateBuffer , ELC_FLIE_LEN);
             }
       }
       else
       {
            read_8209c_energyP();
            format_elc_data();

            if (FLASH_ErasePage(FLASH_ELC_SAVE_ADDRESS) == FLASH_COMPLETE)
            {
                FLASH_Write_chars( FLASH_ELC_SAVE_ADDRESS, (u8*)g_updateBuffer , ELC_FLIE_LEN);
                flash_ok = true;
            }  
       }
       break;
     }
   }
    
  PROCESS_END();
}

/*****************************************************************************
 Prototype    : period_save_data_process
 Description  : 定时保存电量，亮灯时长
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
PROCESS(period_save_data_process, " ");
PROCESS_THREAD(period_save_data_process, ev, data)
{
    PROCESS_BEGIN();

    
    PROCESS_END();
}


/*****************************************************************************
 Prototype    : drop_down_timer_init
 Description  : 初始化掉电检测定时器，定时器超时，表示掉电时间发生。
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void drop_down_timer_init()
{
  TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
  
  RCC_APB1PeriphClockCmd(POWER_DOWN_TIMER_SCK, ENABLE);
  
  TIM_TimeBaseInitStruct.TIM_ClockDivision      =  TIM_CKD_DIV4;
  TIM_TimeBaseInitStruct.TIM_CounterMode        =  TIM_CounterMode_Up; 
  TIM_TimeBaseInitStruct.TIM_Prescaler          =   48000;
  TIM_TimeBaseInitStruct.TIM_Period             =   30; 
  TIM_TimeBaseInitStruct.TIM_RepetitionCounter  =  0;
  TIM_TimeBaseInit(POWER_DOWN_TIMER, &TIM_TimeBaseInitStruct);
  
  TIM_ClearFlag(POWER_DOWN_TIMER,  TIM_FLAG_Update);
  TIM_ITConfig(POWER_DOWN_TIMER, TIM_IT_Update,  ENABLE);
}



#if 0
/*****************************************************************************
 Prototype    : save_8209c_params
 Description  : 保存校表数据，一般只在校表时保存一次，以后不再修改
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void BCD_code(u8 * str, u8 length)
{
  for (u8 i = 0; i < length; i++)
  {
    str[i] = (str[i] / 10) * 16 + (str[i] % 10);
  }
}

/*****************************************************************************
 Prototype    : save_8209c_params
 Description  : 保存校表数据，一般只在校表时保存一次，以后不再修改
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void BCD_decode(u8 * str, u8 length)
{
   for (u8 i = 0; i < length; i++)
  {
    str[i] = (str[i] >> 4)* 10 + (str[i] & 0x0F);
  }
}

/*****************************************************************************
 Prototype    : TIM14_IRQHandler
 Description  : 掉电检测定时器中断函数，掉电数据在此处保存
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/

void TIM14_IRQHandler(void)
{
   if (  TIM_GetITStatus(POWER_DOWN_TIMER,  TIM_IT_Update) != RESET)
   {
      TIM_ClearFlag(POWER_DOWN_TIMER,  TIM_FLAG_Update);
      TIM_Cmd(POWER_DOWN_TIMER, DISABLE);
      
      if (enable_save_elc)
      {
          power_down_protect();
      }
      
      //hal_ToggleLED(0);
   }
}

/*****************************************************************************
 Prototype    : hal_ADC_Init
 Description  : 初始化ADC功能，检测调光口电压
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/

void hal_ADC_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;
    ADC_InitTypeDef adcConfigInitStruct;
    
