barrylw/lamp_project_slave/STM32F051_contiki_8M/APP/gpio_per.c
  if (rn8209c_read(reg, buf, length) == true)
  {
    *((u32*)dat)  = (u32)(buf[0]*16777216 +buf[1]*65536 + buf[2]*256 + buf[3]);
    return length;
  }
  else
  {
    return 0;
  }
}

/*****************************************************************************
 Prototype    : rn8209c_checkSum
 Description  : 8209c是否交表设置好校验和计算
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
u16 rn8209c_checkSum(void)
{
  /* 此处表示从 0x00~0x17寄存器的校验，双字节累加后取反*/
  u16 sum = 0;
  u32 tempVal = 0;
  
  for (u8 i =0; i < 0x18; i ++)
  {
      read_8209c_regs(i ,&tempVal);
      
      sum += tempVal;
  }
  return (~sum);
}

/*****************************************************************************
 Prototype    : find_free_addr
 Description  : 查找flash中空闲可写入位置
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
u16 find_free_addr(u32 addr)
{
  u8 temp;
  
  u16 i;
  
   for ( i = 0; i < (1024 / ELC_FLIE_LEN); i++)
  {
     temp  = *((char*)(addr +i*ELC_FLIE_LEN));
     
     if (temp == 0xFF)
     {
       break;
     }
  }
  
  return i*ELC_FLIE_LEN;
}

/*****************************************************************************
 Prototype    : save_8209c_params
 Description  : 保存校表数据，一般只在校表时保存一次，以后不再修改
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void save_8209c_params(void)
{
  //u32 startADDR = FLASH_PARAMETER_ADDRESS; 

  /* sprintf 应该会自动在末尾添加 0 */
  sprintf(g_updateBuffer,"%s%d;%s%d;%s%d;%s%d;%s%d;%s%d;%s%d;%s%f;",             
          paralist[0],rn8209c_papameter.calibration,
          paralist[1],rn8209c_papameter.PStart,
          paralist[2],rn8209c_papameter.GPQA,
          paralist[3],rn8209c_papameter.PhsA,
          paralist[4],rn8209c_papameter.QPhsCal,
          paralist[5],rn8209c_papameter.Ku,
          paralist[6],rn8209c_papameter.KIa,
          paralist[7],rn8209c_papameter.Kp
          );
  
   if (FLASH_ErasePage(FLASH_PARAMETER_ADDRESS) == FLASH_COMPLETE)
   {
      FLASH_Write_chars( FLASH_PARAMETER_ADDRESS, (u8*)g_updateBuffer ,strlen(g_updateBuffer));
   }
}

/*****************************************************************************
 Prototype    : set_8209c_params
 Description  : 将校表参数写入寄存器，一般在上电初始化时使用
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void set_8209c_params(void)
{
  u32 status;
  
  config_8209c_reg(ADHFConst, rn8209c_papameter.HFConst);
  config_8209c_reg(ADPStart, rn8209c_papameter.PStart);
  config_8209c_reg(ADGPQA, rn8209c_papameter.GPQA);
  config_8209c_reg(ADPhsA, rn8209c_papameter.PhsA);
  config_8209c_reg(ADPFCnt, rn8209c_papameter.PFcount);
  
  //Delayms(1);
  
  read_8209c_regs(ADEMUStatus , &status);
  
  rn8209c_papameter.ChkSum = rn8209c_checkSum();
  
  if ( (status & 0x10000) == 0)
  {
    if (rn8209c_papameter.ChkSum  == (status & 0xFFFF))
    {
       /* 计量状态正常 */
       status = 1;
    }
  }
}

/*****************************************************************************
 Prototype    : find_old_data
 Description  : 寻找旧的有的协议
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
bool find_old_data(u16 length)
{
   int tempi;
   u16 crcval;
   
   /* 如果数据校验错误，则回滚去读以前的数据 */
   for ( tempi = length; tempi >= 0 ; )
   {
       read_flash(FLASH_ELC_SAVE_ADDRESS + length - ELC_FLIE_LEN, (u8*)g_updateBuffer, ELC_FLIE_LEN);

       crcval = (u16)((u16)g_updateBuffer[FLASH_CRC_PINT]*256 + g_updateBuffer[FLASH_CRC_PINT + 1]);

       if (GetCRC16((u8*)g_updateBuffer,ELC_FLIE_LEN-2) == crcval)
       {
           rn8209c_papameter.PFcount       = (u16)(g_updateBuffer[FLASH_PFCOUNT_POINT]*256 +g_updateBuffer[FLASH_PFCOUNT_POINT + 1]);
           rn8209c_papameter.energyAPulse  = (u32)(g_updateBuffer[FLASH_ENERGY_POINT]*16777216 +g_updateBuffer[FLASH_ENERGY_POINT+1]*65536 + g_updateBuffer[FLASH_ENERGY_POINT+2]*256 + g_updateBuffer[FLASH_ENERGY_POINT+3]);
           rn8209c_papameter.lightTime     = (u32)(g_updateBuffer[FLASH_LIGHT_POINT]*16777216 +g_updateBuffer[FLASH_LIGHT_POINT+1]*65536 + g_updateBuffer[FLASH_LIGHT_POINT+2]*256 + g_updateBuffer[FLASH_LIGHT_POINT+3]);
           return true;
       }

       tempi -= ELC_FLIE_LEN;
       /* 保护时间到了以后，再去檫除数据区 */
   }
   
   return false;
}

/*****************************************************************************
 Prototype    : init_8209c_params
 Description  : 从flash中读取数据，初始化参数
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void init_8209c_params(void)
{
  
  /*************************************************************************
    flash file struct  file length = 17
    年 月 日 时 分 电量（4byte） PFcount(2byte) 亮灯时长（4byte） CRC(2byte)
    0              5            9              11               15
  
    FLASH_TIME_POINT,
    FLASH_ENERGY_POINT,
    FLASH_PFCOUNT_POINT,
    FLASH_LIGHT_POINT,
    FLASH_CRC_PINT,
    **************************************************************************/
  
  u16 length;
  u16 crcval;

  read_params_area(FLASH_PARAMETER_ADDRESS);
  
  if (find_params(0, & rn8209c_papameter.calibration) )
  {
        /* 计量校准过，读取参数 */
        if (rn8209c_papameter.calibration == 1)
        {
            find_params(1, &rn8209c_papameter.PStart);
            find_params(2, &rn8209c_papameter.GPQA);
            find_params(3, &rn8209c_papameter.PhsA);

            find_params(5, &rn8209c_papameter.Ku);
            find_params(6, & rn8209c_papameter.KIa);
            find_params(7, & rn8209c_papameter.Kp);

