barrylw/lamp_project_slave/STM32F051_contiki_8M/APP/gpio_per.c
            /*read from flashA */
            length =   find_free_addr(FLASH_ELC_SAVE_ADDRESS);

            /* 存储长度正确 */
            if(  (length < (1024 - ELC_FILE_TAIL_LEN)) &&  (length > 0) )
            {
                read_flash(FLASH_ELC_SAVE_ADDRESS + length - ELC_FLIE_LEN, (u8*)g_updateBuffer, ELC_FLIE_LEN);

                crcval = (u16)((u16)g_updateBuffer[FLASH_CRC_PINT]*256 + g_updateBuffer[FLASH_CRC_PINT + 1]);

                if (GetCRC16((u8*)g_updateBuffer,ELC_FLIE_LEN-2) == crcval)
                {
                    flash_ok = true;
                    rn8209c_papameter.PFcount       = (u16)(g_updateBuffer[FLASH_PFCOUNT_POINT]*256 +g_updateBuffer[FLASH_PFCOUNT_POINT + 1]);
                    rn8209c_papameter.energyAPulse  = (u32)(g_updateBuffer[FLASH_ENERGY_POINT]*16777216 +g_updateBuffer[FLASH_ENERGY_POINT+1]*65536 + g_updateBuffer[FLASH_ENERGY_POINT+2]*256 + g_updateBuffer[FLASH_ENERGY_POINT+3]);
                    rn8209c_papameter.lightTime     = (u32)(g_updateBuffer[FLASH_LIGHT_POINT]*16777216 +g_updateBuffer[FLASH_LIGHT_POINT+1]*65536 + g_updateBuffer[FLASH_LIGHT_POINT+2]*256 + g_updateBuffer[FLASH_LIGHT_POINT+3]);
                }
                else
                {   
                    /* 在保护时间到后，檫除flash, 重新保存数据 */
                    flash_ok = false;
                    /* 读取旧的flash数据，若成功，在保护时间到后，将此数据保存，若读取失败，则参数是初始化数据 */
                    /* 是否做一个轮询flash的函数，错误直接轮询flash */
                    find_old_data(length);
                }
            } 
            else
            {
                /* 存储长度失败，则直接檫除flash */
                /* 是否做一个轮询flash的函数，错误直接轮询flash */
                flash_ok = false;
            }
        }  
  }
  else
  {
     rn8209c_papameter.calibration = 0;
  } 
 
  set_8209c_params();
}

/*****************************************************************************
 Prototype    : format_elc_data
 Description  : 组合电量保存数据
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void format_elc_data(void)
{
  
    /*************************************************************************
    flash file struct  file length = 17
    年 月 日 时 分 电量（4byte） PFcount(2byte) 亮灯时长（4byte） CRC(2byte)
    **************************************************************************/
  
    u16 crc;
    
    RTC_DateTypeDef RTC_DateStructure;
    RTC_TimeTypeDef RTC_TimeStructure;

    /* Get the RTC current date */
    RTC_GetDate(RTC_Format_BIN, &RTC_DateStructure);

    /* Get the RTC current time */
    RTC_GetTime(RTC_Format_BIN, &RTC_TimeStructure);

    g_updateBuffer[0] = RTC_DateStructure.RTC_Year;
    g_updateBuffer[1] = RTC_DateStructure.RTC_Month;
    g_updateBuffer[2] = RTC_DateStructure.RTC_Date;
    g_updateBuffer[3] = RTC_TimeStructure.RTC_Hours;
    g_updateBuffer[4] = RTC_TimeStructure.RTC_Minutes;

    g_updateBuffer[5] = (u8)((rn8209c_papameter.energyAPulse >> 24) &0xFF);
    g_updateBuffer[6] = (u8)((rn8209c_papameter.energyAPulse >> 16) &0xFF);
    g_updateBuffer[7] = (u8)((rn8209c_papameter.energyAPulse >> 8) &0xFF);
    g_updateBuffer[8] = (u8)(rn8209c_papameter.energyAPulse & 0xFF);

    g_updateBuffer[9] = (u8)((rn8209c_papameter.PFcount >> 8) &0xFF);
    g_updateBuffer[10] = (u8)(rn8209c_papameter.PFcount & 0xFF);
    
    g_updateBuffer[11] = (u8)((rn8209c_papameter.lightTime >> 24) &0xFF);
    g_updateBuffer[12] = (u8)((rn8209c_papameter.lightTime >> 16) &0xFF);
    g_updateBuffer[13] = (u8)((rn8209c_papameter.lightTime >> 8) &0xFF);
    g_updateBuffer[14] = (u8)(rn8209c_papameter.lightTime & 0xFF);

    crc = GetCRC16((u8*)g_updateBuffer, 15);

    g_updateBuffer[15] = (u8)((crc >> 8) &0xFF);
    g_updateBuffer[16] = (u8)(crc & 0xFF);
}

/*****************************************************************************
 Prototype    : save_elc_datas
 Description  : 平时保存电量数据函数
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void save_elc_datas(void)
{
    u16 length;
    
    if (enable_save_elc )
    {
      format_elc_data();
      
       length = find_free_addr(FLASH_ELC_SAVE_ADDRESS );
      
      /*  直接存,保证最少一个存储空间留给掉电保存 */
      if ( length >= (1024 - ELC_FILE_TAIL_LEN - ELC_FLIE_LEN) )
      {
          FLASH_ErasePage(FLASH_ELC_SAVE_ADDRESS);
          length = 0;
      }
      
      FLASH_Write_chars( FLASH_ELC_SAVE_ADDRESS + length, (u8*)g_updateBuffer ,ELC_FLIE_LEN); 
    }
}

/*****************************************************************************
 Prototype    : power_down_protect
 Description  : 掉电保护
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void power_down_protect(void)
{
    u32 temp;
    
    u16 length = find_free_addr(FLASH_ELC_SAVE_ADDRESS );
    
    rn8209c_papameter.PFcount = read_8209c_regs(ADPFCnt,&temp); 

    read_8209c_energyP();

    format_elc_data();
   
    temp = FLASH_ELC_SAVE_ADDRESS + length;
    
    FLASH_Write_chars(temp, (u8*)g_updateBuffer ,ELC_FLIE_LEN);
}

/*****************************************************************************
 Prototype    : read_UIP
 Description  : 读取电压，电流，功率
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
void read_UIP(void)
{
    u32 temp;
    read_8209c_regs(ADURMS,&temp);
    rn8209c_papameter.Uv  =   ((temp & 0x800000) > 0) ? 0:(u16)(220.0*10/rn8209c_papameter.Ku*temp);
    read_8209c_regs(ADIARMS,&temp);
    rn8209c_papameter.Ia  =   ((temp & 0x800000) > 0) ? 0: (u32)(IB_05/rn8209c_papameter.KIa*temp*1000.0); 
    
    read_8209c_regs(ADPowerPA,&temp);
    if (temp & 0x80000000)
    {
      temp = (~temp + 1);
    }
    rn8209c_papameter.Pa = (u16)(rn8209c_papameter.Kp*temp/1000000.0);
}


/*****************************************************************************
 Prototype    : read_8209c_energyP
 Description  : 读取电量数据
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
u32 read_8209c_energyP(void)
{
    u32 temp;

    read_8209c_regs(ADPFCnt,&temp);

    rn8209c_papameter.PFcount = temp;

    read_8209c_regs(ADEnergyP2,&temp);

    rn8209c_papameter.energyAPulse += temp;

