barrylw/lamp_project_slave/STM32F051_contiki_8M/APP/gpio_per.c
    rn8209c_papameter.energyA = (u32)( rn8209c_papameter.energyAPulse/rn8209c_papameter.EC * 1000.0);

    return  rn8209c_papameter.energyA;
   
}

/*****************************************************************************
 Prototype    : read_pow_factor
 Description  : 读取功率因数
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
u8 read_pow_factor(void)
{
  u32 powP;
  u32 npowP;
  u8  factor;
  
  read_8209c_regs(ADPowerPA,&powP);
  read_8209c_regs(powerQ,&npowP);
  
  if (powP & 0x80000000)
  {
    powP = (~powP + 1);
  }
  powP = (u32)(rn8209c_papameter.Kp*powP /1000000.0);

  if (npowP & 0x80000000)
  {
    npowP = (~powP + 1);
  }
  
  npowP = (u32)(rn8209c_papameter.Kp*npowP /1000000.0);
  
  factor = (u8)( powP * 100.0 / sqrt(npowP*npowP + powP*powP));
  
  return factor;
}


/*****************************************************************************
 Prototype    : get_light_time
 Description  : 读取亮灯时长
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
u32 get_light_time(void)
{
   return (read_light_time() /60000); 
}


/*****************************************************************************
 Prototype    : read_LED_state
 Description  : 判断灯状态
 Input        : None 
 Output       : None
 Return Value : 
 Date         : 
 Author       : Barry
*****************************************************************************/
bool read_LED_state(void)
{
  /* 1 检测继电器，*/
  /* 2 检测继电器断开，灯关闭*/
  /* 3 继电器检测闭合，再检测实时电流*/
  /* 4 若电流检测状态与开关状态一致，则返回状态，若状态不一致，则报错 */
  if (rn8209c_papameter.pwmValue == 0)
  {
    return false;
  }
  else
  {
    return true;
  }
}










